America
American
April
August
Bible
China
Chinese
Christmas
Coke
December
Easter
English
February
French fries
Friday
Halloween
I
Internet
January
July
June
MRT
March
May
Monday
Mr.
Mrs.
Ms.
November
O.K.
October
PE
ROC
Saturday
September
Sunday
T-shirt
TV
Taiwan
Thanksgiving
Thursday
Tuesday
USA
United States of America
Valentine
Walkman
Wednesday
X-ray
a
a few
a little
a lot
a.m.
able
about
above
abroad
absent
accept
acceptable
accident
accord
account
accurate
ache
achieve
achievement
across
act
action
active
activity
actor
actress
actual
ad
add
additional
address
admire
admit
adopt
adult
advanced
advantage
adventure
advertisement
advice
adviser
advisor
affect
afford
afraid
after
afternoon
afterwards
again
against
age
ago
agree
agriculture
ahead
aim
air
air conditioner
air-conditioner
airlines
airplane
airport
alarm
album
alike
alive
all
alley
allow
almost
alone
along
alphabet
already
also
although
altogether
always
amaze
amazement
ambassador
ambition
ambulance
among
amount
ancient
and
angel
anger
angle
angry
animal
ankle
announce
announcement
another
answer
ant
any
anyone
anything
anywhere
apart
apartment
apologize
apparent
appeal
appear
apple
appreciate
approach
approve
aquarium
area
argue
arm
armchair
army
around
arrange
arrival
arrive
art
artist
as
ash
aside
ask
asleep
assist
assistant
assume
at
athlete
attack
attempt
attention
attitude
attract
attractive
audience
aunt
author
auto
automatic
automobile
autumn
available
avenue
average
avoid
awake
awaken
award
aware
away
awful
ax
axe
baby
baby sitter
back
background
backpack
backward
bacon
bacteria
bad
badly
badminton
bag
baggage
bait
bake
bakery
balance
balcony
ball
balloon
banana
band
bandage
bank
barbecue
barber
bare
barely
bark
barn
barrel
base
baseball
basement
basic
basket
basketball
bat
bath
bathe
bathroom
bay
be
beach
beam
bean
bear
beard
beast
beat
beautiful
beauty
because
become
bed
bedroom
bee
beef
beer
before
beggar
begin
beginner
behave
behind
believe
bell
belly
belong
below
belt
bench
beneath
benefit
berry
beside
besides
between
beyond
bicycle
big
bill
billion
bingo
biology
bird
birthday
biscuit
bite
bitter
black
blackboard
blame
blank
blanket
bleed
bless
blind
block
blood
blouse
blow
blue
board
boat
body
boil
bold
bomb
bone
book
bookcase
bookstore
boot
border
bore
bored
boring
born
borrow
boss
both
bother
bottle
bottom
bow
bowl
bowling
box
boy
brake
branch
brave
bravery
bread
break
breakfast
breast
breath
breathe
breeze
brick
bride
bridge
bright
brilliant
bring
broad
broadcast
brook
broom
brother
brow
brown
brunch
brush
bubble
bucket
bud
budget
buffalo
buffet
bug
build
bulb
bull
bullet
bun
bunch
bundle
burden
burger
burglar
burn
burst
bury
bus
bush
business
businessman
busy
but
butter
butterfly
button
buy
buzz
by
bye
cabbage
cabin
cable
cafeteria
cage
cake
calendar
call
calm
camera
camp
campus
can
cancel
cancer
candle
candy
canoe
canyon
cap
capable
capital
captain
capture
car
card
care
careful
careless
carpenter
carpet
carriage
carrot
carry
cartoon
case
cash
cast
castle
casual
cat
catch
caterpillar
cattle
cause
ceiling
celebrate
cell phone
cent
center
centimeter
central
century
cereal
certain
chain
chair
chalk
challenge
champion
chance
change
changeable
channel
chapter
character
charge
charm
chart
chase
chat
cheap
cheat
check
cheek
cheer
cheerful
cheese
chemistry
cherry
chess
chest
chew
chewing gum
chicken
child
childhood
childish
chill
chilly
chimney
chin
china
chocolate
choice
choke
choose
chop
chopsticks
chubby
church
cigarette
circle
circus
city
civil
clap
class
classical
classmate
classroom
clean
clear
clerk
clever
client
climate
climb
clinic
clip
clock
close
closet
clothes
cloud
cloudy
club
clue
coach
coast
coat
cockroach
cocktail
coconut
coffee
coin
cola
cold
collar
collect
collection
college
colony
color
colorful
column
comb
combine
come
comfort
comfortable
comic
comma
command
comment
commercial
committee
common
communicate
company
compare
comparison
compete
complain
complaint
complete
complex
computer
concern
concert
conclude
conclusion
condition
confident
confuse
congratulation
connect
connection
conscious
consider
considerable
considerate
consideration
constant
contact lens
continent
continue
contract
control
convenience store
convenient
conversation
cook
cookie
cool
copy
corn
corner
correct
cost
cotton
couch
cough
count
countable
country
couple
courage
course
court
cousin
cover
cow
coward
cowboy
crab
cradle
crash
crawl
crayon
crazy
cream
create
creative
creator
creature
credit
credit card
creep
crew
cricket
crime
criminal
crispy
cross
crowd
crowded
crown
cruel
cry
cultural
culture
cup
cupboard
cure
curious
current
curtain
curve
custom
customer
cut
cute
cycle
dad
daddy
daily
dairy
dam
damage
dance
danger
dangerous
dare
dark
darling
dash
date
daughter
dawn
day
dead
deaf
deal
dealer
dear
death
debate
decade
decide
decision
decorate
decrease
deed
deep
deepen
deer
define
definition
degree
delicious
deliver
delivery
democracy
democratic
dentist
department
department store
depend
deposit
describe
description
desert
design
designer
desirable
desire
desk
dessert
destroy
detail
detect
determine
develop
devil
dial
dialogue
diamond
diary
dictionary
die
diet
difference
different
difficult
difficulty
dig
diligent
dining room
dinner
dinosaur
diplomat
direct
direction
dirt
dirty
disappear
disappoint
disappointment
disc
discount
discover
discovery
discuss
discussion
disease
dish
dishonest
disk
dislike
distance
dive
divide
dizzy
do
doctor
dodge
dodge ball
dog
doll
dollar
dolphin
domestic
donkey
door
dot
double
doubt
doubtful
doughnut
down
downstairs
downtown
dozen
dragon
drama
dramatic
draw
drawer
dream
dress
dresser
drink
drip
drive
driver
drop
drown
drowsy
drugstore
drum
drunk
dry
duck
due to
dumb
dump
dumpling
during
dust
duty
e-mail
each
eager
eagle
ear
early
earn
earnings
earrings
earth
ease
east
easy
eat
echo
edge
edition
editor
educate
education
educational
efficient
effort
egg
eight
eighteen
eighth
eighty
either
elbow
elder
elderly
elect
election
electric
electricity
electronic
elementary school
elephant
eleven
else
embarrass
emergency
emotion
emperor
emphasize
employ
employee
employer
employment
empty
enable
end
enemy
energetic
energy
engage
engagement
engine
engineer
enjoy
enjoyable
enough
enter
entrance
envelope
environment
environmental
envy
equal
erase
eraser
error
escape
especially
eve
even
evening
event
ever
every
everybody
everyone
everything
everywhere
evil
exam
example
excellence
excellent
except
exchange
excite
excited
exciting
excuse
exercise
exhibition
exist
existence
exit
expect
expectation
expense
expensive
experience
experiment
explain
explode
export
express
expression
extra
extreme
eye
fable
face
fact
factor
factory
fade
fail
faint
fair
fairy
faith
fake
fall
false
familiar
family
famous
fan
fanatic
fancy
fantastic
far
fare
farm
farmer
farther
fashion
fashionable
fast
fasten
fat
fate
father
faucet
fault
favorite
fax
fear
feather
feature
fee
feed
feel
female
fence
festival
fever
few
fifteen
fifth
fifty
fight
file
fill
film
final
finally
find
fine
finger
finish
fire
firework
first
fish
fisherman
fist
fit
five
fix
flag
flame
flashlight
flat tire
flavor
flea
flesh
flight
float
flock
floor
flour
flower
flu
flute
fly
focus
fog
foggy
fold
folk
follow
follower
fond
food
fool
foolish
foot
football
for
forehead
foreign
foreigner
forest
forever
forget
forgive
fork
form
formal
former
fortune
forty
forward
found
fountain
four
fourteen
fourth
fox
frank
free
freedom
freeze
freezer
freezing
frequent
fresh
friend
friendly
friendship
frighten
frisbee
frog
from
front
fruit
frustrate
fry
full
fun
fund
funny
fur
furniture
future
gain
gamble
game
garage
garbage
garden
garlic
gas
gasoline
gate
gather
general
generous
genius
gentle
gentleman
geography
gesture
get
ghost
giant
gift
girl
give
glad
glance
glass
glasses
global
glory
glove
glow
glue
go
goal
goat
god
gold
golden
golf
good
good-bye
goodbye
goose
gossip
government
governor
gown
grab
grade
gradual
graduate
grain
gram
granddaughter
grandfather
grandma
grandmother
grandpa
grandson
grape
grasp
grass
grasshopper
gray
great
greedy
green
greenhouse
greet
grin
grocery
ground
group
grow
guard
guava
guess
guest
guidance
guide
guitar
gum
gun
guy
gym
habit
hair
haircut
hairdresser
half
hall
hallway
ham
hamburger
hammer
hand
handful
handkerchief
handle
handsome
handy
hang
hanger
happen
happy
harbor
hard
hard-working
harm
harmful
harvest
hat
hatch
hate
have
he
head
headache
headline
headquarters
heal
health
healthy
heap
hear
heart
heat
heater
heaven
heavy
heel
height
helicopter
hell
hello
helmet
help
helpful
hen
here
hero
hesitate
hey
hi
hide
high
highway
hike
hill
him
himself
hint
hip
hippo
hire
his
historical
history
hit
hobby
hold
hole
holiday
hollow
holy
home
homesick
hometown
homework
honest
honesty
honey
honor
hop
hope
horn
horrible
horror
horse
hospital
host
hot
hot dog
hotel
hour
hourly
house
housekeeper
housewife
housework
how
however
hug
human
humankind
humble
humid
humor
humorous
hundred
hunger
hungry
hunt
hunter
hurry
hurt
husband
ice
ice cream
icy
idea
ideal
identity
if
ignorance
ignore
ill
image
imagination
imagine
immediate
impolite
import
importance
important
impossible
impress
impressive
improve
in
inch
include
income
increase
indeed
independent
indicate
individual
indoor
indoors
industrial
inferior
influence
inform
information
injure
injury
ink
inn
inner
innocent
insect
inside
insist
inspect
inspire
instant
instead
instruction
instrument
intelligent
interest
interested
interesting
internal
international
interrupt
interview
into
introduce
introduction
invent
inventor
investigate
invitation
invite
iron
island
it
jacket
jail
jam
jazz
jealous
jeans
jeep
jelly
jet
jewel
jewelry
job
jog
join
joke
journal
journalist
journey
joy
joyful
judge
juice
jump
jungle
junior high school
junk
just
justice
kangaroo
keep
ketchup
kettle
key
keyboard
kick
kid
kidney
kill
kilogram
kilometer
kind
kindergarten
king
kingdom
kiss
kit
kitchen
kite
kitten
knee
kneel
knife
knight
knit
knock
knot
know
knowledge
koala
label
lace
lack
ladder
lady
lake
lamb
lamp
land
language
lantern
large
last
late
later
latter
laugh
laughter
laundry
law
lawn
lawyer
lay
lazy
lead
leader
leaf
leak
leap
learn
least
leather
leave
left
leg
leisure
lemon
lend
lengthen
less
lesson
let
letter
level
liar
liberal
liberty
library
lick
lie
life
lifeboat
lifeguard
lifetime
lift
light
lighthouse
lightning
like
likely
limb
limit
line
link
lion
lip
lipstick
liquid
list
listen
liter
litter
little
live
lively
living room
load
loaf
lobby
lobster
local
lock
locker
lollipop
lonely
long
look
loose
lord
lose
loser
loud
loudspeaker
love
lovely
low
lucky
luggage
lullaby
lunch
lung
machine
mad
magazine
magic
magical
magician
magnet
maid
mail
mail carrier
mailman
main
major
majority
make
male
mall
man
manage
manageable
management
manager
mango
mankind
manner
manners
many
map
marble
march
mark
marker
market
married
marry
marvelous
mask
master
mat
match
math
mathematics
matter
mature
maximum
may
maybe
mayor
meadow
meal
mean
meaningful
meanwhile
measure
meat
mechanic
medal
media
medical
medicine
medium
meet
meeting
melt
member
membership
memorize
memory
men's room
mental
mention
menu
merchant
merry
mess
message
metal
meter
method
microphone
microwave
middle
midnight
might
mighty
mile
milk
million
millionaire
mind
miner
minor
minority
minus
minute
miracle
mirror
misery
miss
missile
missing
mission
mistake
mix
mixture
mob
mobile
model
modern
moist
moisture
mom
moment
mommy
money
monk
monkey
monster
month
mood
moon
mop
moral
more
morning
mosquito
most
motel
mother
motion
motor
motorcycle
mountain
mouse
mouth
move
movement
movie
much
mud
murder
muscle
museum
mushroom
music
musical
musician
must
mystery
nail
name
nanny
napkin
narrow
nation
national
native
natural
nature
naughty
navy
near
necessary
necessity
neck
necklace
necktie
need
needle
negative
neighbor
neighborhood
neither
nephew
nerve
nervous
nest
net
network
never
new
news
newspaper
next
nice
nickname
niece
night
nine
nineteen
ninety
ninth
no
noble
nobody
nod
noise
noisy
none
noodle
noon
nor
normal
north
nose
not
note
notebook
nothing
notice
novel
novelist
now
number
nurse
nut
o'clock
obey
object
observe
obvious
occasion
ocean
odd
of
off
offer
office
officer
often
oil
old
on
once
one
oneself
onion
only
open
operation
operator
opinion
opportunity
opposite
optimistic
or
orange
order
ordinary
origin
original
orphan
other
ought to
our
ours
ourselves
out
outdoors
outer
outline
outside
oven
over
overcoat
overseas
overweight
owe
own
owner
ownership
ox
p.m.
pack
package
page
pain
painful
paint
painter
pair
pajamas
palace
pale
pan
pancake
panda
panic
pants
papaya
paper
parade
paradise
parcel
pardon
parent
park
parking lot
parrot
part
participate
partner
party
pass
passage
passenger
passion
passport
password
past
paste
path
patience
patient
pattern
pause
pavement
paw
pay
pea
peace
peaceful
peach
peak
pear
pearl
peel
peep
pen
pencil
penny
people
pepper
perfect
perform
performance
perhaps
period
permission
permit
person
personal
personality
persuade
pet
phone
photo
physical education
physics
piano
pick
pickle
picnic
picture
pie
piece
pig
pigeon
pile
pill
pillow
pilot
pin
pine
pineapple
pink
pipe
pity
pizza
place
plain
plan
planet
plant
plastic
plate
platform
play
player
playground
pleasant
please
pleased
pleasure
plenty
plug
plum
plumber
plus
pocket
poem
point
poison
pole
police
polite
political
politician
politics
poll
pollute
pollution
pond
pony
pool
poor
pop
pop music
popcorn
popular
population
pork
portion
portrait
position
positive
possible
post meridiem
post office
postage
postcard
poster
postpone
pot
potato
pound
pour
poverty
powder
power
practical
practice
praise
pray
prayer
precious
preparation
prepare
present
president
pressure
pretend
pretty
prevent
previous
price
priest
primary
prince
princess
principal
principle
print
printer
private
prize
probable
problem
process
produce
product
production
professor
profit
program
progress
project
promise
promote
pronounce
proof
proper
property
proposal
protect
protection
protective
proud
provide
pub
public
pull
pumpkin
punish
puppy
pure
purple
purpose
purse
pursue
push
put
puzzle
quarrel
quarter
queen
question
quick
quiet
quit
quite
quiz
quote
rabbit
race
racial
radar
radio
railroad
railway
rain
rainbow
raincoat
rainy
raise
raisin
rank
rare
rat
rate
rather
raw
ray
razor
reach
react
reaction
read
ready
real
realize
really
reason
reasonable
receipt
receive
receiver
recognize
record
recorder
recover
rectangle
recycle
red
reduce
refrigerator
refuse
regional
regret
regular
reject
relative
relax
release
reliable
relief
religion
religious
rely
remain
remember
remind
remote
remove
renew
rent
repair
repeat
replace
report
reporter
represent
representative
republic
request
reserve
resist
resource
respect
respond
response
responsibility
responsible
rest
restaurant
restrict
restroom
result
return
reveal
review
revise
ribbon
rice
rich
rid
riddle
ride
right
ring
ripe
rise
risk
river
road
roar
roast
rob
robber
robbery
robe
robot
rock
rocket
role
roll
romantic
roof
room
root
rope
rose
rotten
rough
round
routine
row
rub
rubber
rude
rug
ruin
rule
ruler
rumor
run
rush
rusty
sad
safe
safety
sail
sailor
sake
salad
salary
sale
salesman
salt
same
sample
sand
sandwich
satisfactory
satisfy
saucer
sausage
save
savings
say
scale
scarce
scarecrow
scared
scarf
scary
scatter
scene
scenery
schedule
scholar
scholarship
school
science
scientific
scientist
scooter
score
scout
scream
screen
screw
scrub
sea
seafood
seal
search
season
seat
second
secondary
secret
secretary
section
security
see
seed
seek
seem
seesaw
seize
seldom
select
selfish
sell
semester
send
senior high school
sense
sensible
sensitive
sentence
separation
serious
servant
serve
service
seven
seventeen
seventh
seventy
several
sew
sex
sexual
sexy
shade
shadow
shake
shall
shallow
shame
shampoo
shape
share
shark
sharp
shave
she
sheep
sheet
shelf
shepherd
shine
shiny
ship
shirt
shoe
shoot
shop
shopkeeper
shore
short
shorten
shortly
shorts
should
shoulder
shout
shovel
show
shower
shrimp
shrink
shut
shy
sick
side
sidewalk
sigh
sight
sign
signal
significant
silence
silent
silly
silver
similar
similarity
simple
sin
since
sincere
sing
singer
single
sink
sip
sir
sister
sit
situation
six
sixteen
sixth
sixty
size
skate
ski
skill
skillful
skin
skinny
skip
skirt
sky
skyscraper
slave
sleep
sleepy
sleeve
slender
slice
slide
slim
slippers
slippery
slope
slow
small
smart
smell
smile
smoke
smooth
snack
snail
snake
sneakers
sneaky
snow
snowman
snowy
so
soap
soccer
social
society
sock(s)
soda
sofa
soft drink
softball
soldier
solid
solve
some
someday
somehow
someone
something
sometimes
somewhat
somewhere
son
song
soon
sore
sorrow
sorry
soul
sound
soup
sour
south
soy sauce
space
spaghetti
speak
speaker
special
specific
speech
speed
spell
spend
spice
spider
spill
spin
spirit
spit
splash
spoil
spoon
sports
spot
spray
spread
spring
sprinkle
spy
square
squeeze
stab
stable
stadium
staff
stairs
stamp
stand
star
stare
start
starve
state
station
stationery
statue
stay
steady
steak
steal
steam
steep
step
stepchild
stepfather
stepmother
stereo
sticky
stiff
still
sting
stingy
stir
stitch
stocking
stomach
stomachache
stone
stool
stop
store
storm
stormy
story
stove
straight
strange
stranger
strategy
straw
strawberry
stream
street
strength
strike
strong
structure
stubborn
student
studio
study
stuff
stupid
style
subject
substance
suburb
subway
succeed
success
successful
such
suck
suffer
sufficient
sugar
suggest
suicide
suit
suitable
sum
summary
summer
summit
sun
sunny
super
superior
supermarket
supper
support
suppose
sure
surf
surprise
surprised
surround
survey
survival
survive
survivor
suspect
suspicion
swallow
swan
swear
sweat
sweater
sweep
sweet
swell
swift
swim
swimsuit
swing
switch
sword
symbol
system
table
table tennis
tablet
tail
tailor
take
talent
talk
talkative
tall
tame
tangerine
tank
tape
taste
tax
taxi
tea
teach
teacher
team
teapot
tear
tease
technical
technique
technology
teenager
telephone
television
tell
temper
temperature
temple
temporary
ten
tend
tender
tennis
tent
tenth
term
terrible
terrific
territory
test
text
textbook
than
thank
thankful
that
the
theater
then
theory
there
therefore
these
they
thick
thief
thin
thing
think
third
thirsty
thirteen
thirty
this
those
though
thousand
thread
threat
threaten
three
throat
through
throw
thumb
thunder
ticket
tickle
tide
tidy
tie
tiger
tight
tighten
time
tiny
tip
tired
tissue
title
to
toast
tobacco
today
toe
tofu
together
toilet
tomato
tomorrow
ton
tongue
tonight
too
tool
tooth
toothache
toothbrush
top
topic
tortoise
toss
total
touch
tourism
tourist
toward
towel
tower
town
toy
trace
trade
trader
tradition
traditional
traffic
trail
train
transport
trap
trash
travel
traveler
treasure
treat
tree
tremble
trend
triangle
tribe
trick
tricky
trip
troop
tropical
trouble
trousers
truck
true
trumpet
trunk
trust
truth
truthful
try
tub
tube
tug
tulip
tumble
tummy
tune
tunnel
turkey
turn
turtle
tutor
twelve
twenty
twice
twin
twist
two
type
typewriter
typhoon
typical
ugly
umbrella
uncle
under
underline
underpass
understand
underwear
unhappy
uniform
union
unique
unite
universe
university
unless
until
up
upper
upset
upstairs
us
use
useful
usual
usually
vacant
vacation
valley
valuable
value
van
vanish
variety
various
vary
vase
vegetable
vehicle
vendor
verse
very
vest
vice-president
victim
victory
video
village
violence
violent
violin
visible
vision
visit
visitor
vitamin
vivid
vocabulary
voice
volleyball
volume
vote
wage
wagon
waist
wait
waiter
waitress
wake
waken
walk
wall
wallet
wander
want
war
warm
warmth
warn
wash
waste
watch
water
waterfall
watermelon
wave
wax
way
we
weak
weaken
wealth
wealthy
wear
weather
weave
web
weed
week
weekday
weekend
weep
weight
welcome
well
west
wet
whale
what
wheat
wheel
when
where
whether
which
while
whip
whistle
white
who
whole
whose
why
wicked
wide
wife
wild
will
willow
win
wind
window
windy
wing
wink
winner
winter
wipe
wisdom
wise
wish
with
without
wolf
woman
women's room
wonderful
wood
word
work
workbook
worker
world
worm
worry
would
wound
wrap
wrist
write
writer
wrong
xylophone
yard
yawn
yeah
year
yell
yellow
yes
yesterday
yet
yoga
yolk
you
young
youngster
your
yours
yourself
yourselves
youth
yummy
zebra
zero
zipper
zone
zoo